{"pages":[{"title":"About me","text":"Who I am Coder Sharer Founder What I do Android Miniapp Consensus Where I go Shared economy Mobile internet Blockaichian","link":"/about/index.html"}],"posts":[{"title":"Hello, world!","text":"Let’s begin~","link":"/hello-world/"},{"title":"Hexo multi-language with Minos","text":"I want to build a hexo blog with full site multi-language, search a lot and try, but no one perfect. Today it’s done, finally I can white down a tutorial for your reference. What I seek Full Site Multi-language Choose English as the default language, and translate full site into your native language, all items one to one correspondence. dengcbWelcome to my GitHub Why use Minos Hexo hasn’t multi-language kernel, though you can install official i18n plugin, but only get some translated shell, all the content in different languages still mix together. Minos is a simple and powerful theme, and support the multi-language thoroughly with lastest release. How I tryPassing Pit Official i18n PluginSet i18n_dir: :lang in _config.yml, you can generate an i18n slug, just that. All multilingual posts still mix. Note: the setting also needs in Minos. hexo-generator-i18nThis plugin can get multilingual pages, but not posts or tags, because hexo kernel doesn’t support. hexo-multilingual and its generatorThis is a real plugin that changes the kernel, you should uninstall all official generators first. But the author is too busy to fix some issues. And this plugin always start ‘en’ in default slug. Other TricksSuch as build two sites and different route; or rewrite the core code. I think it’s not what I want, drop it. Meeting MinosView a lot of themes, choose Minos at last, not the popular next theme. Because I want the classical website to be less colorful, less drawing, just words or ascii codes. So Minos wins. I hope more hexor can choose Minos like me. When using Minos at first, it doesn’t support multi-language yet. Its 1.0 version has been released more than 2 years. Author just want to update to 2.0, and plan to support i18n fully. I test this days and feedback some issues, the latest release finally achieve the full site multi-language support today (post、page、archive、category、tag、search、switcher etc.). Now I can tell you how I build site with Minos. Convention best What we needIs variety needs, or simple to use. If former, the full site multi-language still needs time, Minos is not the silver bullet. If later, congratulations, you can do it today with least configurations. Such as, you set config to: permalink: :category/:title/, then slug as: /nothing/zh-cn/hello-world/, that’s the conflict between convention and configuration. Let’s agree Use default config, try not to whim 12345678910language: - en - zh-cnpermalink: :title/i18n_dir: :langnew_post_name: :title.mdcategory_map: 无他: nothingtag_map: 随笔: anything Install minimal plugins, less is better 1234567891011121314151617181920&#123; \"name\": \"dengcb.github.io\", \"version\": \"1.0.0\", \"private\": true, \"hexo\": &#123; \"version\": \"3.7.1\" &#125;, \"dependencies\": &#123; \"hexo\": \"^3.7.1\", \"hexo-deployer-git\": \"^0.3.1\", \"hexo-generator-archive\": \"^0.1.5\", \"hexo-generator-category\": \"^0.1.3\", \"hexo-generator-index\": \"^0.2.1\", \"hexo-generator-tag\": \"^0.2.0\", \"hexo-renderer-ejs\": \"^0.3.0\", \"hexo-renderer-marked\": \"^0.3.0\", \"hexo-renderer-sass\": \"^0.3.2\", \"hexo-server\": \"^0.2.0\" &#125;&#125; Install Minos from root git clone https://github.com/ppoffice/hexo-theme-minos.git themes/minos at themes/minos, new 3 config files _config.yml _config.en.yml _config.zh-cn.yml in _config.zh.yml, set site name and menu 123456789# Sitetitle: 长斌# Menumenu: 归档: /zh-cn/archives 分类: /zh-cn/categories 标签: /zh-cn/tags 关于: /zh-cn/about Create posts, and follow the structure 1234567891011_post/ hello-world.md zh-cn/ hello_world.mdabout/ index.mdzh-cn/ about/ index.mdCNAMEfavicon.png Copy post to source/_post/&lt;lang&gt;/ Copy page tosource/&lt;lang&gt;/ That’s the Convention best, create the structure, then generate full site multi-language, done. Generate, Test, Deploy, enjoy it! 1234hexo cleanhexo ghexo s -shexo d Thanks Special Minos author ppoffice who designed and coded Minos such excellent theme. After I feedback, he continues to code and modify, realize all ideals I have set for hexo theme. Next, I will post a blog how send the site to IPFS system.","link":"/hexo-minos-multi-language/"}],"tags":[{"name":"anything","slug":"anything","link":"/tags/anything/"},{"name":"tutorial","slug":"tutorial","link":"/tags/tutorial/"}],"categories":[{"name":"other","slug":"other","link":"/categories/other/"},{"name":"web","slug":"web","link":"/categories/web/"},{"name":"nothing","slug":"other/nothing","link":"/categories/other/nothing/"},{"name":"hexo","slug":"web/hexo","link":"/categories/web/hexo/"}]}